{"glossary":[{"name":"A/A Test","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An A/B test in which the experiences being tested are identical to one\n  another. This is done in an effort to determine statistical validity of the\n  A/B tool, the metric being monitored, and the analysis process being used.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"A/B Testing","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The process of providing two or more different experiences across two or more\n  subgroups of a population. The goal is to measure the change in behavior of\n  the subgroups upon receiving the respective experiences.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Accuracy","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The number of true positives plus the number of true negatives divided by the\n  total number of examples.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Activation Function","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The function used on the output of a neuron. These activations can be linear\n  or nonlinear. If they're nonlinear, they can be symmetric or asymmetric.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Adagrad","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An optimizer used to update the weights of a neural network in which different\n  learning rates are applied to different weights.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Adam","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A common gradient descent optimizer that takes advantage of momentum and\n  adaptive learning rates.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Agglomerative Clustering","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A clustering algorithm that builds a hierarchy of subclusters that gradually\n  group into a single cluster. Some techniques for measuring distances between\n  clusters are single-linkage and complete-linkage methods.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Amazon Kinesis","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eAn AWS product that provides a way to handle real-time data streaming.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Apache Airflow","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A workflow management system that provides users a way to author, schedule,\n  and execute software.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Apache Kafka","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An open-source software platform which provides a way to handle real-time data\n  streaming.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Apache Spark","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A software interface which provides implicit parallelism and fault tolerance\n  across a cluster of machines.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Apache YARN","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A software product responsible for managing compute resources across a cluster\n  of machines.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Arithmetic Mean","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eThe average of a series of numbers.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Automated Machine Learning (Auto-ML)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A strategy which automates the process of applying features and labels to a\n  machine learning model.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Availability Zone (AZ)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Typically a single data center within a region which has two or more data\n  centers. The term \"multi-AZ\" implies that an application or software resource\n  is present across more than one AZ within a region. This strategy allows the\n  software resource to continue operating even if a data center becomes\n  unavailable.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Avro","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eA row-oriented data serializer provided by Apache.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Backpropagation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The use of the derivative chain rule along with dynamic programming to\n  determine the gradients of the loss function in neural networks.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Backpropagation Through Time","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Backpropagation within an RNN in which an additional partial derivative term\n  is calculated per time step that the input required.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Bagging","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Also bootstrap aggregation, a sampling technique which selects subsets of\n  examples and/or features to train an ensemble of models. This generally\n  reduces the variance error.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Batch Normalization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The process of normalizing values by means of re-centering (subtracting the\n  mean) or re-scaling (dividing by the standard deviation) before they go to\n  subsequent layers in a neural network. The goal is to accelerate the learning\n  of deep neural networks by decreasing the number of epochs required for the\n  loss function to converge.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Bernoulli Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A distribution which evaluates a particular outcome as binary. In the\n  Bernoulli Naive Bayes classifier case, a word was either in a message or not\n  in a message, which is binary representation.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Beta Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  This distribution is used to model percentages and proportions such as\n  click-through probabilities.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Bias-variance Tradeoff","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A pursuit of balance between the errors produced by the bias and the variance\n  of a particular model. The higher the bias, or assumptions injected into the\n  model, typically the more bias error is produced. This generally results in a\n  model which underfits the training examples, which means the assumptions limit\n  the model's ability to properly learn.\n\u003c/p\u003e\n\u003cp\u003e\n  In contrast, the fewer assumptions are injected into the model, the more\n  variance is allowed in the model parameters, which means the model may learn\n  from the noise in the training examples. This generally results in a model\n  which overfits the training examples, which means the lack of assumptions\n  limit the model's ability to properly learn.\n\u003c/p\u003e\n\u003cp\u003e\n  The errors from the bias and variance, combined with the irreducible error,\n  make up the overall model error. Both overfitting and underfitting can inhibit\n  the model's ability to generalize or predict the labels of the test examples.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Binary Classification","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A supervised learning task in which there are two possible outputs.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Bisected K-means","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Using k-means with k equal to 2 for subsets of the examples in an effort to reduce the chance of converging to a local optima.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Boosting","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An ensemble technique which trains many weak learners sequentially, with each subsequent weak learner being trained on the previous weak learner's error. This generally reduces the bias error.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Candidate Generator","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A system which outputs the candidates to be ranked. This is sometimes referred to as retrieving the ‘top-k'\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Cell State","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Used within a Long short-term memory (LSTM) acting as an additional hidden state.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Central Processing Unit (CPU)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A general purpose compute resource responsible for executing computer programs.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Centroid","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The location of the center of a cluster in n-dimensions.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Change Data Capture","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The process of recording changes in the data within a database system. For\n  instance, if a user cancels their Netflix subscription, then the row in some\n  table will change to indicate that they're no longer a subscriber.\n\u003c/p\u003e\n\u003cp\u003e\n  The change in this row can be recorded and referenced later for analysis or\n  audit purposes.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Channels","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The number of stacked images, typically representing Red Green Blue pixels, or\n  the number of feature maps produced by a convolutional layer.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Classification and Regression Tree","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also CART, is an algorithm for constructing an approximate optimal decision tree for given examples.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Clickstream","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An ordered series of interactions that users have with some interface. In the\n  traditional sense, this can be literal clicks of a mouse on a desktop browser.\n  Interactions can also come from touchscreens and conversational user\n  interfaces.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Closed-Form Solution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        For our case, this is what ordinary least squares provides for linear regression. It's a formula which solves an equation.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Cluster","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A consolidated group of points.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Coefficient","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Another name for a parameter in the regression model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Cold-start","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A challenge with recommendation systems in which users or items are new and that there is limited or no information in terms of the user-item matrix. This can make personalized recommendations difficult or impossible.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Collaborative Filtering","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A recommendation technique which uses many user's and item's data typically in the form of a user-item matrix.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Collinearity","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When one or more (multicollinearity) independent variables are not actually independent.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Concurrency","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When two or computer programs share a single processor.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Confidence Interval","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The possible range of an unknown value. Often comes with some degree of probability e.g. 95% confidence interval.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Confusion Matrix","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        In the binary case, a 2x2 matrix indicating the number of true positives, true negatives, false positives and false negatives.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Constrained Optimization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Opposed to an unconstrained optimization problem in which we can use gradient descent, optimization problems with constraints usually require other optimization methods. If there are equality constraints, Lagrange multipliers can often be used. If there are inequality constraints, then linear or quadratic programming can often be used.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Content Filtering","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A recommendation technique which takes into account a single user's features and many items' features.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Convex Function","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Function with one optima.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Convolutional Layer","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Similar to a fully connected neural layer; however, each neuron is only\n  connected to a subset of neurons in the subsequent layer with respect to a\n  receptive field.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Cookie","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A small piece of data stored by a browser which indicates stateful information for a particular website. For instance, a cookie can be stored in your browser after you log in to a website to indicate that you are logged in. This will stop subsequent pages from asking you to log in again.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Correlation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The relationship between a dependent and independent variable.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Cosine Similarity","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A similarity metric which is equal to the cosine of the angle between two inputs in some embedding space.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Cross-Entropy Loss","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A loss function which is used in classification tasks. It's technically the entropy of the true labels plus the KL-divergence of the predicted and true labels. Minimizing the cross-entropy minimizes the difference between the true and predicted label distributions.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Governance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The method of managing, using, and protecting an organization's data.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Ingestion","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A subsystem responsible for processing incoming data. Typically, the data comes from clickstreams, change data captures, or existing data stores.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Parallelism","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A machine learning model training strategy used to maximize the utilization of compute resources (CPUs/GPUs) in which the data is distributed across two or more devices\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Processing","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The process of altering data by means of aggregation, joins, transformations, and others.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Replication","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A strategy used to mitigate the potential of data loss in the event of a system or component failure. In the most basic form, it involves writing identical data to more than one device or location. More efficient techniques like erasure coding incorporate mathematics to recover lost data without referring to an explicit copy of the data. \n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Database","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A tool used to collect and organize data. Typically, database management\n  systems allow users to interact with the database.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Decision Point","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also decision rule or threshold, is a cut-off point in which anything below the cutoff is determined to be a certain class and anything above the cut-off is the other class.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Decision Tree","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A tree-based model which traverses examples down to leaf nodes by the properties of the examples features.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Deep Learning","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Optimizing neural networks, often with many hidden layers, to perform\n  unsupervised or supervised learning.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Dependent Variable","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A variable whose variation depends on other variables.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Derivative","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Indicates how much the output of a function will change with respect to a\n  change in its input.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Dimensionality Reduction","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The process of reducing the dimensionality of features. This is typically useful to speed up the training of models and in some cases, allow for a wider number of machine learning algorithms to be used on the examples. This can be done with SVD (or PCA) and as well, certain types of neural networks such as autoencoders.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Dimensions","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Here, the number of features associated with a particular example.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Discriminative Model","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A model which aims to approximate the conditional probability of the features and labels.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Distributed Cache","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A cache which is distributed across two or more machines\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Dot product","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Here, the inner product, such that two provided vectors are element-wise multiplied followed by summing each result to produce a scalar.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Downsampling","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Removing a number of majority class examples. Typically done in addition to upweighting.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Dropout","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A regularization technique used per layer to reduce overfitting. Dropout involves randomly omitting neurons from the neural network structure at each training iteration. Effectively, dropout produces an ensemble of neural networks. Dropout is incomplete without adjusting for the dropout in preparation for prediction\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Early Stopping","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Halting the gradient descent process prior to approaching a minima or maxima.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Echo Chamber","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A state of a recommendation system in which user behavior is reinforced by the recommendations themselves.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Eigendecomposition","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Applicable only to square matrices, the method of factoring a matrix into its eigenvalues and eigenvectors. An eigenvector is a vector which applies a linear transformation to some matrix being factored. The eigenvalues scale the eigenvector values.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Elastic MapReduce (EMR)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An Amazon Web Services product which provides users access to a Hadoop cluster. \n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Elbow Method","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A method of finding the best value for k in k-means. It involves finding the elbow of the plot of a range of ks and their respective inertias.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Embedding Layer","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Typically used as the first layer in a neural network which is optimized to transform the input in an effort to maximize.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Embedding Space","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The n-dimensional space where embeddings exist. Typically, the embedding space can be used to generate the top-k candidates by using the k-nearest neighbors algorithm.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Ensemble","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Using more than one model to produce a single prediction.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Epoch","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        One complete cycle of training on all of the examples.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Euclidean Distance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The length of the line between two points.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Evidence","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The denominator of the Naive Bayes classifier.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Exactly-once Semantics","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Guarantees that an object within a distributed system is processed exactly once. Other semantics include maybe, at-least-once, and at-most-once\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Examples","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003ePairs of features and labels.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Experiment Collision","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The event where one experiment unintentionally influences the result of one or more separate experiments.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Exploding Gradient","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The repeated multiplication of large gradients resulting in an overflow, or infinity-value products.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"F1 Score","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The harmonic mean of the precision and recall.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Feature Hashing","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Representing feature inputs, such as articles or messages, as the result of hashes modded by predetermined value.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Feature Interaction","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Features that are multiplied by one another in order to express relationships that can't be represented by adding the independent variable terms together.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Feature Map","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eThe result of applying a kernel to an image or to another feature map.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Feature Normalization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Typically referring to feature scaling that places the values of a feature\n  between 0 and 1.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Feature Standardization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Typically referring to feature scaling that centers the values of a feature\n  around the mean of the feature and scales by the standard deviation of the\n  feature.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Feature Transformation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A mathematical function applied to features.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Features","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A set of quantities or properties describing an observation. They can be\n  binary like \"day\" and \"night\"; categorical like \"morning\", \"afternoon\", and\n  \"evening\"; continuous like 3.141; or ordinal like \"threatened\", \"endangered\",\n  \"extinct\", where the categories can be ordered.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Featurization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The process of transforming raw inputs into something a model can perform training and predictions on.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Flatten Layer","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Takes in a series of stacked feature maps and flattens out all of the values\n  into a single feature vector.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Forward Pass","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Calculating an output of a neural network for a particular input.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Fully Connected Neural Network","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A neural network that has every neuron connected to every other neuron in the\n  subsequent layer; also called a dense layer.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Gated Recurrent Unit","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A type of RNN with a hidden state, update gate, and reset gate.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Gaussian Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A very common type of probability distribution which fits many real world\n  observations; also called a normal distribution.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Generalize","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The ability of a model to perform well on the test set as well as examples beyond the test set.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Generative Adversarial Networks","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also GANs, take advantage of a concept called adversarial min max. The generator generates fake data and tries to minimize a particular loss function and the discriminator tries to correctly identify fake data from real data in an effort to maximize a particular loss function.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Generative Model","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A model which aims to approximate the joint probability of the features and labels.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Gini Impurity","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Used as a way to determine the best split point for a given node in a classification tree. It's based on the probability of incorrectly classifying an item based on all of the items in the node.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Gower Distance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Used to calculate the distance between two points which have mixed feature types.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Gradient","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A vector of partial derivatives. In terms of neural networks, we often use the analytical gradient in software and use the numerical gradient as a gradient checking mechanism to ensure the analytical gradient is accurate.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Gradient Clipping","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Capping the value that the gradient is allowed to be. This is typically used in an effort to avoid exploding gradients. However, initialization techniques are favored.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Gradient Descent","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An iterative algorithm with the goal of optimizing some parameters of a given function with respect to some loss function. If done in batches, all of the examples are considered for an iteration of gradient descent. In mini-batch gradient descent, a subset of examples are considered for a single iteration. Stochastic gradient descent considers a single example per gradient descent iteration.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Graphics Processing Unit","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A specialized device that has many cores, allowing it to perform many\n  operations at a time.\n\u003c/p\u003e\n\u003cp\u003e\n  GPUs are often used within deep learning to accelerate training of neural\n  networks by taking advantage of their ability to perform many parallel\n  computations.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hadoop Distributed File System (HDFS)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An open-source Apache software product which provides a distributed storage framework.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hamming Distance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The sum of the non-matching categorical feature values.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Hard Disk Drive (HDD)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A storage device which operates by setting bits on a spinning magnetic disk. The capacity and the read/write performance of the HDD are the main characteristics to consider when using an HDD within a particular system.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Heuristic","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An approach to finding a solution which is typically faster but less accurate than some optimal solution.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hidden layer","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A layer that's not the input or output layer in a neural network.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hidden State","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The output of the Recurrent Neural Network at the previous timestep.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hinge Loss","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A loss function which is used by a soft-margin SVM.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hyperbolic Tangent","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A symmetric activation function which ranges from -1 to 1.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hyperparameter","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Any parameter associated with a model which is not learned.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hyperparameter Optimization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The process of searching for the best possible values for the hyperparameters of some machine learning model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hyperplane","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A decision boundary in any dimension.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Image Kernel","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A single array consisting of some defined numbers, which is applied to an image\n  for some desired effect. Usually used in the context of image filtering.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Image Padding","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Adding a border of zero-valued pixels to an input image. The goal of padding\n  is typically to ensure that the dimensions of an image remain the same after\n  applying an image kernel. Libraries typically allow two options: Valid Padding,\n  which means not to pad the image, and Same Padding, which means to zero-pad the\n  image.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Implicit Rating","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A rating obtained from user behavior as opposed to surveying the user.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Implicit Relevance Feedback","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Feedback obtained from user behavior as opposed to surveying the user.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"In-memory Database","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A database which relies either solely or primarily on the RAM of a computer.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Independent Variable","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A variable whose variation is independent from other variables.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Inertia","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The sum of distances between each point and the centroid.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Initialization Techniques","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Ways to cleverly initialize the weights of neural networks in an attempt avoid vanishing and exploding gradients. Kaiming initialization, used with asymmetric activation functions and Xavier/Glorot initialization, used with symmetric activation functions are both examples. These techniques usually depend on the fan in and fan out per layer.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Inverse User Frequency","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The added modelling assumption that if a user interacts with a less overall popular item, then the interaction should count for more. \n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Irreducible Error","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The error produced from the noise within the training examples which can't be eliminated with models.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Jaccard Distance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        One minus the ratio of the number of like binary feature values and the number of like and unlike binary feature values, excluding instances of matching zeros.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Jupyter Notebook","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A Project Jupyter product which provides an interactive workspace to execute code.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"K-means++","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Using a weighted probability distribution as a way to find the initial centroid locations for the k-means algorithm.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Keras","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Software that acts as an interface for Tensorflow and aims to simplify the\n  experience of working with neural networks.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Kernel Density Estimation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also KDE, a way to estimate the probability distribution of some data.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Kernel Trick","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The process of finding the dot product of a high dimensional representation of feature without computing the high dimensional representation itself. A common kernel is the Radial Basis Function kernel.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"L2 Loss","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The sum of the squared errors of all the training examples. Not to be confused with L2 regularization.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Labels","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Usually paired with a set of features for use in supervised learning. Can be\n  discrete or continuous.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Laplace Smoothing","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A type of additive smoothing which mitigates the chance of encountering zero probabilities within the Naive Bayes classifier.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Learning Rate","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A multiple, typically less than 1, used during the parameter update step during model training to smooth the learning process.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Lemmatization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A more calculated form of stemming which ensures the proper lemma results from removing the word modifiers.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"LightGBM","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An open-source library created by Microsoft which provides a distributed gradient boosted framework. Short for Light Gradient Boosted Models.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Likelihood","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The probability of some features given a particular class.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Line of Best Fit","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The line through data points which best describe the relationship of a dependent variable with one or more independent variables. Ordinary least squares can be used to find the line of best fit.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Linear Activation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A symmetric activation function which assigns the output as the value of the input.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Local Optima","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A maxima or minima which is not the global optima.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Long Short-term Memory","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A type of RNN with a cell and hidden state, input gate, forget gate, and an output gate.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Manhattan Distance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Sum of the absolute differences of two input features.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Margin","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The space between the hyperplane and the support vectors. In the case of soft margin Support Vector Machines, this margin includes slack.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Matrix","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eAn array of values, usually consisting of multiple rows and columns.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Matrix Factorization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Factors the user-item matrix into embeddings such that multiplying together the resulting embedding layers gives an estimate for the original user-item matrix.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Matrix Transpose","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eAn operator that flips a matrix over its diagonal.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Mcfadden's Pseudo R-squared","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An analog to linear regression's R-squared which typically takes on smaller values than the traditional R-squared.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Mean Absolute Error","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The average of the absolute differences across the training examples.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Mean Average Precision","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A binary ranking metric which takes into account the relevance of ranked items with regards to their position.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Mean Reciprocal Rank","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A binary ranking metric which takes into account the first spot in a ranking which contains a relevant item.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Mean Squared Error","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The average squared difference between the prediction and true label across all examples.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Mechanical Turk","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A crowdsourcing service which performs on-demand tasks that computers are\n  currently unable to do.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["service"]},{"name":"Missing Data","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When some features within an example are missing.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"MLlib","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A library provided by Apache Spark which provides Spark clusters access to machine learning algorithms and related utilities. MLlib provides a Dataframe-based API which is unofficially referred to as Spark ML.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Mode Collapse","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A challenge of training GANs in which the generator generates data which successfully confuses the discriminator and so the generator exploits this vulnerability and only produces that particular data over and over. A way to mitigate this is to force the generator to see responses from the discriminator multiple timesteps ahead. One such method is called an Unrolled GAN.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Model","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An approximation of a relationship between an input and an output.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Model Parallelism","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A machine learning model training strategy used to maximize the utilization of compute resources (CPUs/GPUs) in which the model is distributed across two or more devices.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Model Training","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Determining the model parameter values.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Momentum","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A concept applied to gradient descent in which the gradients applied to the weight updates depends on previous gradients.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Multi-Armed Bandit (MAB)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A process which provides a number of choices\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Multinomial Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A distribution which models the probability of counts of particular outcomes.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Multinomial Logistic Regression","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Logistic Regression in which there are more than two classes to be predicted across.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"N-gram","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A series of adjacent words of length n.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Neuron","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Sometimes called a perceptron, a neuron is a graphical representation of the smallest part of a neural network. For the Machine Learning Crash Course we may reference neurons as nodes or units.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Non-convex Function","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A function which has two or more instances of zero-slope.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Non-differentiable","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A function which has kinks in which a derivative is not defined.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Nonlinear Regression","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A type of regression which models nonlinear relationships in the independent variables.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Norm","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Here, the L2 Norm, is the square root of the sum of squares of each element in a vector.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Normalized Discounted Cumulative Gain","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An information retrieval metric which assigns a value of a particular ranking based on each item's position and relevance.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Numba","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A just-in-time Python compiler which resolves a subset of the python programming language down to machine code\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Odds Ratio","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The degree of associate between two events. If the odds ratio is 1, then the two events are independent. If the odds ratio is greater than 1, the events are positively correlated, otherwise the events are negatively correlated.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"OLAP","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Online analytical processing. A system that handles the analytical processes\n  of a business, including reporting, auditing, and business intelligence. For\n  example, this may be a Hadoop cluster which maintains user subscription\n  history for Netflix. This is opposed to OLTP.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"OLTP","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Online transaction processing. A system that handles (near) real-time business\n  processes. For example, a database that maintains a table of the users\n  subscribed to Netflix and which is then used to enable successful log-ins\n  would be considered OLTP. This is opposed to OLAP.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"One-hot Encoding","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An encoding for categorical variables where every value that a variable can take on is represented as a binary vector\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Online Learning","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Incremental learning within a model to represent an incrementally changing population.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Optimizers","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Techniques which attempt to optimize gradient descent\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Orthogonal","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Perpendicular is n-dimensions.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Outlier","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A feature or group of features which vary significantly from the other features.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"P-value","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The probability of finding a particular result, or a greater result, given a null hypothesis being true.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Parallelization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When two or more computer programs are executed at the same instant across more than one processor.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Parameter","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Any trained value in a model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Parameters","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also, weights, or coefficients. Values to be learned during the model training.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Parquet","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A column-oriented data storage format provided by Apache.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Partial Derivative","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The derivative of a function with respect to a single variable.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Pearson Correlation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A measure of the correlation between two inputs. In the context of recommendation systems. Pearson correlation can be used to construct an item-item similarity matrix.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Polynomial","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eA function with more than one variable/coefficient pair.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Pooling","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Most often max pooling and sometimes average pooling, in which a kernel is\n  applied to an image and the max or average of the pixel values in the kernel\n  overlay is the resulting pixel value in the output image.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Posterior","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The probability of a class given some features.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Pre-trained Models","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Models which have already been trained. These trained models can be used as\n  layers (like embedding layers) of not-yet-trained neural networks to increase\n  performance of these neural network.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Precision","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The number of true positives divided by the true positives plus false positives.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Presentation and Trust Bias","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Biases found within ranking which arise from the placement of items within a ranking.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Principal Component Analysis","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also PCA, is eigendecomposition performed on the covariance matrix of some particular data. The eigenvectors then describe the principle components and the eigenvalues indicate the variance described by each principal component. Typically, SVD is used to perform PCA. PCA assumes linear correlations in the data. If that assumption is not true, then you can use kernel PCA.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Prior","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Indicates the probability of a particular class regardless of the features of some example.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Probability","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  How likely something is to occur. This can be independent, such as the roll of\n  the dice, or conditional, such as drawing two cards subsequently out of a deck\n  without replacement.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Probability Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A function that takes in an outcome and outputs the probability of that\n  particular outcome occurring.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Pruning Neurons","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Removing neurons from a neural network in an effort to reduce the number of model parameters if by removing the neurons, equivalent performance can be obtained.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"R-squared","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also the coefficient of determination, the percent of variance in the dependent variable explained by the independent variable(s).\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Random Access Memory (RAM)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A device on a computer which stores the data and machine code of a running computer program.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Random Forest","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An ensemble technique which trains many independent weak learners. This generally reduces the variance error.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Rank r Approximation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Using up to, and including, the rth terms in the singular value decomposition to approximate an original matrix.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Ranking","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Optimizing machine learning models to rank candidates, such as music,\n  articles, or products. Typically, the goal is to order the candidates such\n  that the candidates which are most likely to be interacted with (purchased,\n  viewed, liked, etc.) are above other candidates that aren't as likely to be\n  interacted with.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Recall","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also sensitivity, is the proportion of true positives which are correctly classified.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Receiver Operator Characteristic Curve","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also ROC curve, is a plot of how the specificity and sensitivity change as the decision threshold changes. The area under the ROC curve, or AUC, is the probability that a randomly chosen positive example will have a higher prediction probability of being positive than a randomly chosen negative example.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Receptive Field","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The number of neurons in a preceding layer which are connected to an adjacent\n  layer of neurons. The largest receptive field is a fully-connected neural\n  network.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Recommendation Carousel","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A component within a graphical or conversational user interface which presents recommendations to a user. This can include products, ads, and media content.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Recommendation Systems","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Systems with the goal of presenting an item to a user such that the user will\n  most likely purchase, view, or like the recommended item. Items can take many\n  forms, such as music, movies, or products. Also called recommender systems.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Rectified Linear Unit","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An asymmetric activation function which outputs the value of the positive inputs and zero otherwise. There are variations such as the Leaky ReLU. They can be susceptible to the dead neuron problem but generally perform well in practice.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Recurrent Neural Network","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also RNN, a neural network in which the output is routed back into the network to be used with the subsequent input.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Regularization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A technique of limiting the ability for a model to overfit by encouraging the values parameters to take on smaller values.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Residuals","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The distance between points and a particular line.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Sample Selection Bias","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The bias that occurs when sampling a population into one or more subgroups at random results in a systematic inclusion or exclusion of some data.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Sample Size","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The number of observations taken from a complete population.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Scalar","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A single value, as opposed to a vector.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"scikit-learn","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A machine learning python library which provides implementations of regression, classification, and clustering.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["library"]},{"name":"Seasonality","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The predictable changes of data throughout the calendar year.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Sensitivity","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also recall, is the proportion of true positives which are correctly classified.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Session ID","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A unique identifier assigned to a user to keep track of a user's connected interactions. For instance, a session may include a user logging in, purchasing an item, and logging out. Here, the session ID would be used to reference the group of those three interactions. This session ID can be stored in the user's internet browser as a cookie.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Shadow Test","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Running two or more versions of software in parallel while only surfacing the result of one of the experiences to the end user. This is done in an effort to gauge the differences between the software versions.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Shift Invariance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  One of the goals of a convolutional neural network: objects within an image\n  can be in different areas of the image yet still be recognized.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Shilling Attack","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A type of attack on a recommendation system in which users manipulate the recommendations by inflating or deflating positive interactions for their own or competing items.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Shrinkage","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A learning rate for gradient boosted trees.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Side Features","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Features in addition to item and user embeddings. This can include properties of items and users.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Sigmoid Function","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also the logistic function, a function which outputs a range from 0 to 1.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Silhouette Method","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A method of finding the best value for k in k-means. It takes into account the ratios of the inter and intra clusters distances.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Simple Matching Distance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        One minus the ratio of the number of like binary feature values and the number of like and unlike binary feature values.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Simpson's Paradox","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When a pattern emerges in segments of examples but is no longer present when the segments are grouped together.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Singular Value Decomposition","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also SVD, a process which decomposes a matrix into rotation and scaling terms. It is a generalization of eigendecomposition.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Slack","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The relaxing of the constraint that all examples must lie outside of the margin. This creates a soft-margin SVM.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Softmax","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A sigmoid which is generalized to more than two classes to be predicted against.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"SparkML","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Refers to APIs which provide machine learning capabilities on Spark dataframes.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Specificity","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The proportion of true negatives which are correctly classified.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Split Point","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A pair of feature and feature value which is assigned to a node in a decision tree. This split point will determine which examples will go left and which examples go right based on the feature and feature value.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Standard Deviation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The amount of deviation around the mean for a particular distribution  \n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"statsmodels","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Python module which provides various statistical tools.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Stemming","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Removing the ending modifiers of words, leaving the stem of the word.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Stop Word","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A word, typically discarded, which doesn't add much predictive value.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Stride","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The incremental rate at which a kernel is applied to an image or feature map.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Sub-gradient","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The gradient of a non-differentiable function.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Supervised Learning","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Optimizing machine learning models based on previously observed features and\n  labels. Typically, the goal is to attach the most likely label to some\n  provided features.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Support Vectors","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The most difficult to separate points in regard to a decision boundary. They influence the location and orientation of the hyperplane.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Surrogate Split","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A suboptimal split point reserved for examples which are missing the optimal split point feature.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"TF-IDF","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Short for \u003cb\u003eTerm Frequency-Inverse Document Frequency\u003c/b\u003e, TF-IDF is a method\n  of transforming features, usually representing counts of words, into values\n  representing the overall importance of different words across some documents.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Time Decay","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The added modelling assumption that interactions between items and users should count for less over time.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Tokenization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The splitting of some raw textual input into individual words or elements.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Unbalanced Classes","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When one class is far more frequently observed than another class.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Uniform Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A probability distribution in which each outcome is equally likely; for\n  example, rolling a normal six-sided die.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Unsupervised Learning","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An approach within machine learning that takes in unlabeled examples and\n  produces patterns from the provided data. Typically, the goal is to discover\n  something previously unknown about the unlabeled examples.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Upweighting","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Increasing the impact a minority class example has on the loss function. Typically done in addition to downsampling.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"User Agent","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An identifier used to describe the software application which a user is using to interact with another software application. For instance, an HTTP request to a website typically includes the user agent so that the website knows how to render the webpage.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"User-item Matrix","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A matrix which contains the interactions of users and items. Items can take the form of products, music, and videos.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Validation","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The technique of holding out some portion of examples to be tested separately from the set of examples used to train the model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Vanishing Gradient","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The repeated multiplication of small gradients resulting in an underflow, or 0-value products.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Variance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The standard deviation squared.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Variance Inflation Factor","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A measure of multicollinearity in a regression model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Vector","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Here, a feature vector, which is a list of features representing a particular\n  example.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["math"]},{"name":"Vectorizer","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Used in a step of featurizing. It transforms some input into something else. One example is a binary vectorizer which transforms tokenized messages into a binary vector indicating which items in the vocabulary appear in the message.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Vocabulary","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The list of words that the Naive Bayes classifier recognizes.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Weak Learner","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Shallow decision trees in our case. However, it generally can be any underfitting model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"XGBoost","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An open-source library which provides a gradient boosted framework. Short for Extreme Gradient Boosting.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Zookeeper","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A service designed to reliably coordinate distributed systems via naming\n  service, configuration management, data synchronization, leader election,\n  message queuing, or notification systems.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]}],"fundamentals":[{"uid":"introduction","name":"Introduction","module":"Introduction","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":true,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"Welcome to our series on Large-Scale Machine Learning! Here, we'll really dig into some of the more practical applications of the field and equip you with the tools you need to design and build complex machine-learning systems for enterprise-level businesses.\n\nAre you ready to take your knowledge and expertise to the next level?","video":{"vimeoId":"545870056","duration":2,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142045340-86cee01ee2ceff58be3214a4d5e28d804b856939d1cca65dc23e93382430a4ec-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[],"section":"Introduction","hasCodeExample":false},{"uid":"data-ingestion","name":"Data Ingestion","module":"Data Support","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":true,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"In order to do anything with a machine-learning system, you first need to feed it some inputs. In this first video of the series, we'll look at technologies you can use to ingest data into your systems and review some considerations you can make throughout this process.\n\nLet's dive in!","video":{"vimeoId":"540427352","duration":17,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1139989444-00f3acdbd74760db41dbfdaffb5ce360d11f8e3e4e286c2165cbec664c687daf-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Clickstream","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An ordered series of interactions that users have with some interface. In the\n  traditional sense, this can be literal clicks of a mouse on a desktop browser.\n  Interactions can also come from touchscreens and conversational user\n  interfaces.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Change Data Capture","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The process of recording changes in the data within a database system. For\n  instance, if a user cancels their Netflix subscription, then the row in some\n  table will change to indicate that they're no longer a subscriber.\n\u003c/p\u003e\n\u003cp\u003e\n  The change in this row can be recorded and referenced later for analysis or\n  audit purposes.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Apache Kafka","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An open-source software platform which provides a way to handle real-time data\n  streaming.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Amazon Kinesis","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eAn AWS product that provides a way to handle real-time data streaming.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Zookeeper","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A service designed to reliably coordinate distributed systems via naming\n  service, configuration management, data synchronization, leader election,\n  message queuing, or notification systems.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":["tech"]},{"name":"Database","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A tool used to collect and organize data. Typically, database management\n  systems allow users to interact with the database.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"OLTP","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Online transaction processing. A system that handles (near) real-time business\n  processes. For example, a database that maintains a table of the users\n  subscribed to Netflix and which is then used to enable successful log-ins\n  would be considered OLTP. This is opposed to OLAP.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"OLAP","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Online analytical processing. A system that handles the analytical processes\n  of a business, including reporting, auditing, and business intelligence. For\n  example, this may be a Hadoop cluster which maintains user subscription\n  history for Netflix. This is opposed to OLTP.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Availability Zone (AZ)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  Typically a single data center within a region which has two or more data\n  centers. The term \"multi-AZ\" implies that an application or software resource\n  is present across more than one AZ within a region. This strategy allows the\n  software resource to continue operating even if a data center becomes\n  unavailable.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Data Support","hasCodeExample":true},{"uid":"data-storage","name":"Data Storage","module":"Data Support","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"If you've gone through our Systems Design Fundamental series, then you know how important having a high-performing storage model is to any system.\n\nAnd guess what? Massive, computationally-intense ML systems are certainly no exception!","video":{"vimeoId":"552641976","duration":19,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142046711-017f59cb1038b36dca0eeaa27cf4448f6a3e4e237d4a104a90e2aecc1bafe791-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Hard Disk Drive (HDD)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A storage device which operates by setting bits on a spinning magnetic disk. The capacity and the read/write performance of the HDD are the main characteristics to consider when using an HDD within a particular system.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Replication","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A strategy used to mitigate the potential of data loss in the event of a system or component failure. In the most basic form, it involves writing identical data to more than one device or location. More efficient techniques like erasure coding incorporate mathematics to recover lost data without referring to an explicit copy of the data. \n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Hadoop Distributed File System (HDFS)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An open-source Apache software product which provides a distributed storage framework.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Avro","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003eA row-oriented data serializer provided by Apache.\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Parquet","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A column-oriented data storage format provided by Apache.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Exactly-once Semantics","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Guarantees that an object within a distributed system is processed exactly once. Other semantics include maybe, at-least-once, and at-most-once\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Data Support","hasCodeExample":true},{"uid":"data-processing","name":"Data Processing","module":"Data Support","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"Ingesting and storing data into your system is great, but without a robust processing engine in place to extract features and labels from that data, you won't get very far.\n\nFortunately, as is often the case in the software engineering world, Apache comes in clutch with some nifty solutions to our woes.","video":{"vimeoId":"540428733","duration":26,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142047361-840f25e351f3fe91d977a1e234acf7f65c458c82bd4cd0e44e1dabb14307cbec-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Recommendation Carousel","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A component within a graphical or conversational user interface which presents recommendations to a user. This can include products, ads, and media content.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Central Processing Unit (CPU)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A general purpose compute resource responsible for executing computer programs.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Seasonality","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The predictable changes of data throughout the calendar year.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Parallelization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When two or more computer programs are executed at the same instant across more than one processor.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Random Access Memory (RAM)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A device on a computer which stores the data and machine code of a running computer program.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Apache Spark","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A software interface which provides implicit parallelism and fault tolerance\n  across a cluster of machines.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Apache YARN","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A software product responsible for managing compute resources across a cluster\n  of machines.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Elastic MapReduce (EMR)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An Amazon Web Services product which provides users access to a Hadoop cluster. \n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Jupyter Notebook","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A Project Jupyter product which provides an interactive workspace to execute code.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Data Support","hasCodeExample":true},{"uid":"processing-orchestration","name":"Processing Orchestration","module":"Data Support","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"In the previous video, we looked at how you might go about manually processing data. This obviously isn't scalable, so the next step is to remove the human element and fully automate the process.\n\nLuckily, and perhaps unsurprisingly, we can once again turn to Apache to help us accomplish this goal!","video":{"vimeoId":"540429713","duration":13,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142048010-ef336fbf8251b05f3cac52586b30a467f34b14611d8e802bc58cccba6322af70-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Apache Airflow","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A workflow management system that provides users a way to author, schedule,\n  and execute software.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Data Support","hasCodeExample":true},{"uid":"workspaces","name":"Workspaces","module":"Exploration","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"With your data-support pipeline in place, the final missing piece of the puzzle is setting up an organized workspace from which you can explore all of your model combinations and ultimately manage every single bit—pun absolutely intended—of data.","video":{"vimeoId":"540430104","duration":6,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142048618-afa53f055ffd3d229a46b4f05d3e852c885541a12fb67678166aa698d8d91c76-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Automated Machine Learning (Auto-ML)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A strategy which automates the process of applying features and labels to a\n  machine learning model.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Governance","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The method of managing, using, and protecting an organization's data.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Exploration","hasCodeExample":false},{"uid":"frequentist-ab-testing","name":"Frequentist AB Testing","module":"Experimentation","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"\u003cb\u003eA:\u003c/b\u003e Here, we'll introduce A/B testing—from the frequently used frequentist perspective.\n\n\u003cb\u003eB:\u003c/b\u003e Here, we'll cover frequentist A/B testing—don't tell the Bayesians!","video":{"vimeoId":"552642536","duration":24,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142049321-c702f95e086353b763f8a2f69fa7d95aa9a387890d3d9f7535dd702afd670de7-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"A/B Testing","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  The process of providing two or more different experiences across two or more\n  subgroups of a population. The goal is to measure the change in behavior of\n  the subgroups upon receiving the respective experiences.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"A/A Test","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  An A/B test in which the experiences being tested are identical to one\n  another. This is done in an effort to determine statistical validity of the\n  A/B tool, the metric being monitored, and the analysis process being used.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"User Agent","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        An identifier used to describe the software application which a user is using to interact with another software application. For instance, an HTTP request to a website typically includes the user agent so that the website knows how to render the webpage.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Session ID","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A unique identifier assigned to a user to keep track of a user's connected interactions. For instance, a session may include a user logging in, purchasing an item, and logging out. Here, the session ID would be used to reference the group of those three interactions. This session ID can be stored in the user's internet browser as a cookie.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Cookie","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A small piece of data stored by a browser which indicates stateful information for a particular website. For instance, a cookie can be stored in your browser after you log in to a website to indicate that you are logged in. This will stop subsequent pages from asking you to log in again.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Experimentation","hasCodeExample":false},{"uid":"bayesian-ab-testing","name":"Bayesian AB Testing","module":"Experimentation","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"Using your prior knowledge, there's a strong likelihood that you'll see the benefits of using Bayesian A/B tests over frequentist A/B tests. \n\nIf not, you can always A/B test them.","video":{"vimeoId":"540430860","duration":10,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142049924-128bb6ce39f539f264745af5bf94d468ef8caafc6b98aef255585d56592dff70-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Beta Distribution","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  This distribution is used to model percentages and proportions such as\n  click-through probabilities.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Experimentation","hasCodeExample":false},{"uid":"multi-armed-bandit","name":"Multi-Armed Bandit","module":"Experimentation","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"While the multi-armed bandit we'll be covering here isn't a kraken plundering gold from pirate ships (that would be pretty cool), the idea of a monstrous cephalopod pillaging vessels is a surprisingly decent metaphor for this alternative to A/B testing!","video":{"vimeoId":"540431122","duration":15,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142051032-4e136e1533d339bd5f9b12140ab999c9e92cb9428e8760dbff930cc31705adfc-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Multi-Armed Bandit (MAB)","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A process which provides a number of choices\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Experimentation","hasCodeExample":false},{"uid":"impact-estimation","name":"Impact Estimation","module":"Experimentation","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"In business, money talks. So if you want your super-duper cool ML projects to be given the greenlight in a business setting, you need to prove that they will yield some financial value to the company.\n\nThis video is full of tips to ensure you emerge from this series not only as an MLExpert, but also as a ProfitExpert!","video":{"vimeoId":"552643116","duration":16,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142051628-9b4f957504419022f79b584f873ff2b348e200be49d67423cf1961b5ecacf5f6-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Shadow Test","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Running two or more versions of software in parallel while only surfacing the result of one of the experiences to the end user. This is done in an effort to gauge the differences between the software versions.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Sample Selection Bias","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The bias that occurs when sampling a population into one or more subgroups at random results in a systematic inclusion or exclusion of some data.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Experiment Collision","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The event where one experiment unintentionally influences the result of one or more separate experiments.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Experimentation","hasCodeExample":false},{"uid":"basic-models","name":"Basic Models","module":"Large-Scale Training","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"In the Machine Learning Crash Course, we looked at a number of basic machine-learning models you can use, but we did so from a simplified, theoretical point of view.\n\nIt's time to revisit some of these models and explore how we can alter them to work in a large, enterprise-level data setting.","video":{"vimeoId":"540431950","duration":13,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142052542-150c93be6d0d7ce408bda10d8a2cfbc7ed8ebb30a5937e17266e9531d277ad60-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"MLlib","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A library provided by Apache Spark which provides Spark clusters access to machine learning algorithms and related utilities. MLlib provides a Dataframe-based API which is unofficially referred to as Spark ML.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Large-Scale Training","hasCodeExample":true},{"uid":"deep-learning-models","name":"Deep Learning Models","module":"Large-Scale Training","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"Just like in the previous video, we're going to put the practical in the academic and take a deeper—pun, as usual, intended—look at deep-learning models.\n\nFire up that play button!","video":{"vimeoId":"552643534","duration":29,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142053528-c3114f148bbb7411c92325d5d013e647fe24ab1e62938c601a12184d359a850d-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Model Parallelism","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A machine learning model training strategy used to maximize the utilization of compute resources (CPUs/GPUs) in which the model is distributed across two or more devices.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Data Parallelism","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A machine learning model training strategy used to maximize the utilization of compute resources (CPUs/GPUs) in which the data is distributed across two or more devices\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Graphics Processing Unit","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n  A specialized device that has many cores, allowing it to perform many\n  operations at a time.\n\u003c/p\u003e\n\u003cp\u003e\n  GPUs are often used within deep learning to accelerate training of neural\n  networks by taking advantage of their ability to perform many parallel\n  computations.\n\u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Concurrency","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        When two or computer programs share a single processor.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Large-Scale Training","hasCodeExample":true},{"uid":"model-validation","name":"Model Validation","module":"Large-Scale Training","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"The hyperparameter tuning process of complex, business-grade ML models can often cost hundreds of thousands of dollars, so it is imperative to optimize this process in a way that minimizes its cost.\n\nRemember, you cannot be a true MLExpert without also being a seasoned ProfitExpert!","video":{"vimeoId":"540433626","duration":18,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142054826-f28a23a8c58150c42530044b6001ac151ceb2fb1605e9129c50b62267001b3b9-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Hyperparameter Optimization","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The process of searching for the best possible values for the hyperparameters of some machine learning model.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Large-Scale Training","hasCodeExample":true},{"uid":"productionization","name":"Productionization","module":"Productionization","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"Transitioning your model from the experimentation phase to a live production environment is the final step! A lot of time, money, and resources have been invested at this point, so it's critical to reduce the human-error element as much as possible to ensure a smooth and successful launch.","video":{"vimeoId":"540434220","duration":8,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142055983-c86d4fbb5d6cebef62fabba527d3b2f49f40c0eed17197367943d2143259a3db-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[{"name":"Recall","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        Also sensitivity, is the proportion of true positives which are correctly classified.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Precision","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        The number of true positives divided by the true positives plus false positives.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"keyTerms":[],"section":"Productionization","hasCodeExample":false},{"uid":"data-hosting","name":"Data Hosting","module":"Hosting","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"Production environments have stricter performance requirements than testing environments, especially with regards to latency; after all, you're serving real users, so every millisecond is precious!\n\nIn this video, we'll look at how we can leverage in-memory databases and distributed caching to crush latency and keep users happy.","video":{"vimeoId":"540434405","duration":6,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142057255-f0e76f28758c9967eb51ce526b7029671265cb5a18f443ebee26042eef5f2dd4-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"In-memory Database","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A database which relies either solely or primarily on the RAM of a computer.\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]},{"name":"Distributed Cache","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A cache which is distributed across two or more machines\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Hosting","hasCodeExample":false},{"uid":"model-hosting","name":"Model Hosting","module":"Hosting","releaseDate":"0001-01-01T00:00:00Z","acl":{"isFree":false,"isFreeForStudents":false,"productRequired":["mlexpert"],"isAvailable":true},"description":"You've made it to the finish line! In this final video of the Large-Scale Machine-Learning series, we'll continue down the hosting-optimization rabbit hole we previously dove into.\n\nA true MLExpert isn't satisfied until they've eradicated all traces of latency from their systems, even when serving millions of users!","video":{"vimeoId":"540434556","duration":12,"annotations":[],"instructor":"Ryan Doan","thumbnail":"https://i.vimeocdn.com/video/1142058456-5bfd36c3ba5b33a45a698afadab9b92631f8d8970941bd0f40e26f479a4d8c24-d_640x360?r=pad"},"questions":[],"references":[],"codeExample":null,"links":null,"preReqs":[],"keyTerms":[{"name":"Numba","section":null,"definition":"\u003cdiv class=\"html\"\u003e\n\u003cp\u003e\n        A just-in-time Python compiler which resolves a subset of the python programming language down to machine code\n    \u003c/p\u003e\n\u003c/div\u003e","url":null,"kinds":[]}],"section":"Hosting","hasCodeExample":true}]}
